#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖``

<details><summary>Show Plan</summary>

```

terraform
module.oidc.data.aws_iam_openid_connect_provider.this: Reading...
module.website.data.aws_iam_policy_document.website_iam_policy: Reading...
aws_ecr_repository.app: Refreshing state... [id=ui-forge-ai-studio]
module.website.aws_s3_bucket.website_bucket: Refreshing state... [id=ui-forge-ai-studio]
aws_iam_role.this: Refreshing state... [id=github_oidc_role_ui-forge-ai-studio]
module.website.data.aws_iam_policy_document.website_iam_policy: Read complete after 0s [id=115665691]
module.oidc.data.aws_iam_openid_connect_provider.this: Read complete after 0s [id=arn:aws:iam::789798665829:oidc-provider/token.actions.githubusercontent.com]
module.oidc.data.aws_iam_policy_document.oidc: Reading...
module.oidc.data.aws_iam_policy_document.oidc: Read complete after 0s [id=3914002254]
aws_ecr_lifecycle_policy.app_lifecycle: Refreshing state... [id=ui-forge-ai-studio]
aws_ecr_repository_policy.app_policy: Refreshing state... [id=ui-forge-ai-studio]
module.website.aws_s3_bucket_policy.website_bucket_policy: Refreshing state... [id=ui-forge-ai-studio]
module.website.aws_s3_bucket_public_access_block.example: Refreshing state... [id=ui-forge-ai-studio]
module.website.aws_s3_bucket_website_configuration.website_configuration: Refreshing state... [id=ui-forge-ai-studio]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_iam_role.this will be destroyed
  # (because aws_iam_role.this is not in configuration)
  - resource "aws_iam_role" "this" {
      - arn                   = "arn:aws:iam::789798665829:role/github_oidc_role_ui-forge-ai-studio" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringEquals = {
                              - "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                            }
                          - StringLike   = {
                              - "token.actions.githubusercontent.com:sub" = "repo:araltiparmak/ui-forge-ai-studio:ref:refs/heads/main"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::789798665829:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2025-02-05T21:00:11Z" -> null
      - force_detach_policies = false -> null
      - id                    = "github_oidc_role_ui-forge-ai-studio" -> null
      - managed_policy_arns   = [] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "github_oidc_role_ui-forge-ai-studio" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {
          - "ManagedBy" = "Terraform"
          - "Repo"      = "ui-forge-ai-studio"
        } -> null
      - unique_id             = "AROA3PY5LHZSXF6ZLNAVJ" -> null
        # (3 unchanged attributes hidden)
    }

  # module.oidc.aws_iam_role.this will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                            }
                          + StringLike   = {
                              + "token.actions.githubusercontent.com:sub" = "repo:araltiparmak/ui-forge-ai-studio:ref:refs/heads/main"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::789798665829:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "github-actions-araltiparmak-ui-forge-ai-studio"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "ManagedBy" = "Terraform"
          + "Repo"      = "ui-forge-ai-studio"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @araltiparmak, Action: `pull_request`*